
## Plan Result




<pre><code>Plan: 12 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;create-linked-hearing-group&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;delete-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;delete-linked-hearing-group&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;direct-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;create-linked-hearing-group&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;delete-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;delete-linked-hearing-group&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;direct-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;create-linked-hearing-group&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;delete-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;delete-linked-hearing-group&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;direct-hearing&#34;]
* Update
  * module.api_mgmt_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["create-linked-hearing-group"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Create Linked Hearing Group"
      + display_name        = "Create Linked Hearing Group"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "create-linked-hearing-group"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/resources/linked-hearing-group"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = false
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["delete-hearing"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Delete Hearing"
      + display_name        = "Delete Hearing"
      + id                  = (known after apply)
      + method              = "DELETE"
      + operation_id        = "delete-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/hearings/{hearing-id}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }

      + template_parameter {
          + name     = "hearing-id"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["delete-linked-hearing-group"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Delete Linked Hearing Group"
      + display_name        = "Delete Linked Hearing Group"
      + id                  = (known after apply)
      + method              = "DELETE"
      + operation_id        = "delete-linked-hearing-group"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/resources/linked-hearing-group/{groupClientReference}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = false
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 202
        }

      + template_parameter {
          + name     = "groupClientReference"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["direct-hearing"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Direct Hearings"
      + display_name        = "Direct Hearings"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "direct-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/hearings/sessions/{sessionId}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 202
        }

      + template_parameter {
          + name     = "sessionId"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["create-linked-hearing-group"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "create-linked-hearing-group"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["delete-hearing"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "delete-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["delete-linked-hearing-group"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "delete-linked-hearing-group"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["direct-hearing"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "direct-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["create-linked-hearing-group"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "resources"
      + id               = (known after apply)
      + name             = "resources"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["delete-hearing"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "hearings"
      + id               = (known after apply)
      + name             = "hearings"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["delete-linked-hearing-group"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "resources"
      + id               = (known after apply)
      + name             = "resources"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["direct-hearing"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "hearings"
      + id               = (known after apply)
      + name             = "hearings"
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":46,"Program":"tfcmt","SHA1":"","Vars":{}} -->